# Importing Packages

In [1]:
import pandas as pd 
import numpy as np

# Importing Dataset and Exploratory Data Analysis

In [2]:
#Converting IMDb Names CSV to a dataframe 

df_n = pd.read_csv('/Users/abbyborbon/Documents/Data/IMDB/IMDb Data/IMDb names.csv')

In [4]:
# Converting data type of date of birth column to datetime 

pd.to_datetime(df_n['date_of_birth'], errors = 'ignore')

0         1899-05-10
1         1924-09-16
2         1934-09-28
3         1949-01-24
4         1918-07-14
             ...
297700           NaN
297701           NaN
297702    1992-05-02
297703           NaN
297704    1986-03-20
Name: date_of_birth, Length: 297705, dtype: object

In [5]:
# Converting data type of date of death column to datetime 

pd.to_datetime(df_n['date_of_death'], errors = 'ignore')

0         1987-06-22
1         2014-08-12
2                NaN
3         1982-03-05
4         2007-07-30
             ...
297700           NaN
297701           NaN
297702           NaN
297703           NaN
297704           NaN
Name: date_of_death, Length: 297705, dtype: object

In [6]:
#Reviewing data type of columns 

datatype = df_n.dtypes
datatype

imdb_name_id              object
name                      object
birth_name                object
height                   float64
bio                       object
birth_details             object
date_of_birth             object
place_of_birth            object
death_details             object
date_of_death             object
place_of_death            object
reason_of_death           object
spouses_string            object
spouses                    int64
divorces                   int64
spouses_with_children      int64
children                   int64
dtype: object

In [7]:
# Preview of data 

df_n.head()

,imdb_name_id,name,birth_name,height,bio,birth_details,date_of_birth,place_of_birth,death_details,date_of_death,place_of_death,reason_of_death,spouses_string,spouses,divorces,spouses_with_children,children
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...","May 10, 1899 in Omaha, Nebraska, USA",1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987-06-22,"Los Angeles, California, USA",pneumonia,Robyn Smith (27 June 1980 - 22 June 1987) (hi...,2,0,1,2
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,"September 16, 1924 in The Bronx, New York City...",1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014-08-12,"New York City, New York, USA",stroke,Jason Robards (4 July 1961 - 10 September 196...,2,1,2,3
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...","September 28, 1934 in Paris, France",1934-09-28,"Paris, France",NaN,NaN,NaN,NaN,Bernard d'Ormale (16 August 1992 - present)\n...,4,3,1,1
3,nm0000004,John Belushi,John Adam Belushi,170.0,"John Belushi was born in Chicago, Illinois, US...","January 24, 1949 in Chicago, Illinois, USA",1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982-03-05,"Hollywood, Los Angeles, California, USA",acute cocaine and heroin intoxication,Judith Belushi-Pisano (31 December 1976 - 5 M...,1,0,0,0
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...","July 14, 1918 in Uppsala, Uppsala län, Sweden",1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden (...",2007-07-30,"Fårö, Gotlands län, Sweden",natural causes,Ingrid Bergman (11 November 1971 - 20 May 199...,5,4,5,8

In [8]:
#Converting IMDb Movies CSV to a dataframe 

df_m = pd.read_csv('/Users/abbyborbon/Documents/Data/IMDB/IMDb Data/IMDb movies.csv')

/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [ ]:
#Mixed int in 3 columns of int and str

In [9]:
#Located the issue in the year column and replaced str with the year 

df_m['year'] = df_m['year'].replace(['TV Movie 2019'], '2019')

In [10]:
#Checked to make sure that row was replaced in the year column 

df_m.iloc[83917,3]

'2019'

In [11]:
#Checked data type of row 

type(df_m.iloc[83917,3])

str

In [12]:
#Converting the row from str to int to match the data type of the column 

df_m['year'] = df_m['year'].apply(lambda x: pd.to_numeric(x, errors = 'ignore'))

In [13]:
#Rechecking data type 

type(df_m.iloc[83917,3])

numpy.int64

In [ ]:
#Date published had the same issue of being a str instead of datetime

In [14]:
#Located the row 

df_m.loc[df_m['date_published'] == 'TV Movie 2019']

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
83917,tt8206668,Bad Education,Bad Education,2019,TV Movie 2019,"Biography, Comedy, Crime",108,USA,English,Cory Finley,...,"Hugh Jackman, Ray Romano, Welker White, Alliso...",The beloved superintendent of New York's Rosly...,7.1,23973,NaN,NaN,NaN,79.0,135.0,98.0

In [15]:
#Replaced the str for the correct datetime information 

df_m['date_published'] = df_m['date_published'].replace(['TV Movie 2019'], '2019-09-08')

In [16]:
#Changed date published column to datetime data type 

pd.to_datetime(df_m['date_published'])

0       1894-10-09
1       1906-12-26
2       1911-08-19
3       1912-11-13
4       1911-03-06
           ...
85850   2020-01-29
85851   2020-02-13
85852   2019-03-08
85853   2019-03-15
85854   2020-02-05
Name: date_published, Length: 85855, dtype: datetime64[ns]

In [ ]:
# Must delete $ and convert those strings to int while ignoring foreign currency and NAN for budget

In [17]:
#Shows the count for types of dtype in the budget column 

df_m['budget'].apply(type).value_counts()

<class 'float'>    62145
<class 'str'>      23710
Name: budget, dtype: int64

In [18]:
#Removing the dollar sign character from budget 

df_m['budget'].str.replace(' ', '')
df_m['budget'] = df_m['budget'].str.replace('$', '')

<ipython-input-18-ef24360bde0c>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df_m['budget'] = df_m['budget'].str.replace('$', '')

In [19]:
df_m['budget'] = pd.to_numeric(df_m['budget'], errors='coerce')

In [ ]:
# For usa gross income will delete dollar sign and ignore foreign / NAN

In [20]:
#Removing the dollar sign from budget 

df_m['usa_gross_income'].str.replace(' ', '')
df_m['usa_gross_income'] = df_m['usa_gross_income'].str.replace('$', '')

<ipython-input-20-dac7f5b9548d>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df_m['usa_gross_income'] = df_m['usa_gross_income'].str.replace('$', '')

In [21]:
df_m['usa_gross_income'] = pd.to_numeric(df_m['usa_gross_income'], errors='coerce')

In [ ]:
# For world gross income will delete dollar sign and ignore foreign / NAN

In [22]:
df_m['worlwide_gross_income'].str.replace(' ', '')
df_m['worlwide_gross_income'] = df_m['worlwide_gross_income'].str.replace('$', '')

<ipython-input-22-3fecdd42cc5f>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df_m['worlwide_gross_income'] = df_m['worlwide_gross_income'].str.replace('$', '')

In [23]:
df_m['worlwide_gross_income'] = pd.to_numeric(df_m['worlwide_gross_income'], errors='coerce')

In [ ]:
#Correcting column name of world gross

In [24]:
df_m.rename(columns = {'worlwide_gross_income':'worldwide_gross_income'}, inplace = True)

In [25]:
#Reviewing dtypes

df_m.dtypes

imdb_title_id              object
title                      object
original_title             object
year                        int64
date_published             object
genre                      object
duration                    int64
country                    object
language                   object
director                   object
writer                     object
production_company         object
actors                     object
description                object
avg_vote                  float64
votes                       int64
budget                    float64
usa_gross_income          float64
worldwide_gross_income    float64
metascore                 float64
reviews_from_users        float64
reviews_from_critics      float64
dtype: object

In [26]:
#Previewing data 

df_m.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worldwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,2250.0,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,45000.0,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0

In [ ]:
#Converting IMDb ratings CSV to a dataframe

In [27]:
df_r = pd.read_csv('/Users/abbyborbon/Documents/Data/IMDB/IMDb Data/IMDb ratings.csv')

In [ ]:
#Checking the dtypes

In [28]:
df_r.dtypes

imdb_title_id                 object
weighted_average_vote        float64
total_votes                    int64
mean_vote                    float64
median_vote                  float64
votes_10                       int64
votes_9                        int64
votes_8                        int64
votes_7                        int64
votes_6                        int64
votes_5                        int64
votes_4                        int64
votes_3                        int64
votes_2                        int64
votes_1                        int64
allgenders_0age_avg_vote     float64
allgenders_0age_votes        float64
allgenders_18age_avg_vote    float64
allgenders_18age_votes       float64
allgenders_30age_avg_vote    float64
allgenders_30age_votes       float64
allgenders_45age_avg_vote    float64
allgenders_45age_votes       float64
males_allages_avg_vote       float64
males_allages_votes          float64
males_0age_avg_vote          float64
males_0age_votes             float64
males_18age_avg_vote         float64
males_18age_votes            float64
males_30age_avg_vote         float64
males_30age_votes            float64
males_45age_avg_vote         float64
males_45age_votes            float64
females_allages_avg_vote     float64
females_allages_votes        float64
females_0age_avg_vote        float64
females_0age_votes           float64
females_18age_avg_vote       float64
females_18age_votes          float64
females_30age_avg_vote       float64
females_30age_votes          float64
females_45age_avg_vote       float64
females_45age_votes          float64
top1000_voters_rating        float64
top1000_voters_votes         float64
us_voters_rating             float64
us_voters_votes              float64
non_us_voters_rating         float64
non_us_voters_votes          float64
dtype: object

In [29]:
#Previewing data

df_r.head()

,imdb_title_id,weighted_average_vote,total_votes,mean_vote,median_vote,votes_10,votes_9,votes_8,votes_7,votes_6,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000009,5.9,154,5.9,6.0,12,4,10,43,28,...,5.7,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0
1,tt0000574,6.1,589,6.3,6.0,57,18,58,137,139,...,6.2,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0
2,tt0001892,5.8,188,6.0,6.0,6,6,17,44,52,...,5.8,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0
3,tt0002101,5.2,446,5.3,5.0,15,8,16,62,98,...,5.5,14.0,6.1,21.0,4.9,57.0,5.5,207.0,4.7,105.0
4,tt0002130,7.0,2237,6.9,7.0,210,225,436,641,344,...,7.3,82.0,7.4,77.0,6.9,139.0,7.0,488.0,7.0,1166.0

In [ ]:
#Converting IMDb title principals CSV to a dataframe

In [30]:
df_tp = pd.read_csv('/Users/abbyborbon/Documents/Data/IMDB/IMDb Data/IMDb title_principals.csv')

In [ ]:
#Checking dtype

In [31]:
df_tp.dtypes

imdb_title_id    object
ordering          int64
imdb_name_id     object
category         object
job              object
characters       object
dtype: object

In [43]:
#Reviewing count of each data type in the characters column 

df_tp['characters'].apply(type).value_counts()

<class 'float'>    494677
<class 'str'>      340836
Name: characters, dtype: int64

In [32]:
#Previewing data 

df_tp.head()

,imdb_title_id,ordering,imdb_name_id,category,job,characters
0,tt0000009,1,nm0063086,actress,NaN,"[""Miss Geraldine Holbrook (Miss Jerry)""]"
1,tt0000009,2,nm0183823,actor,NaN,"[""Mr. Hamilton""]"
2,tt0000009,3,nm1309758,actor,NaN,"[""Chauncey Depew - the Director of the New Yor..."
3,tt0000009,4,nm0085156,director,NaN,NaN
4,tt0000574,1,nm0846887,actress,NaN,"[""Kate Kelly""]"

In [ ]:
#Exporting to csv

In [33]:
df_n.to_csv('cleaned_imbd_names.csv')
df_m.to_csv('cleaned_imbd_movies.csv')
df_r.to_csv('cleaned_imbd_ratings.csv')
df_tp.to_csv('cleaned_imbd_title_principle.csv')

In [ ]:
#Importing

In [34]:
from sqlalchemy import create_engine
import psycopg2

In [ ]:
#Making an engine to convert from python dataframe to sql

In [37]:
engine = create_engine('postgresql://postgres:password@localhost:5432/imbd')
df_n.to_sql('names', engine)
df_m.to_sql('movies', engine)
df_r.to_sql('ratings', engine)
df_tp.to_sql('title_principle', engine)